# a = float(input("Введите число с большим количеством знаков в дробной части: ")) # 27 задача
# aa = a * 2
# print(aa)

# b = float(input("Введите число с большим количеством знаков в дробной части: ")) # 28 задача
# bb = b * 2
# print(round(bb, 2))

# import math # 29 задача
# c = int(input("Введите число больше 500: "))
# cc = math.sqrt(c)
# print(round(cc, 2))

# import math #30 задача
# d = math.pi
# print(round(d, 5))

# import math # 31 задача
# e = int(input("Введите радиус: "))
# ee = (e**2) * math.pi
# print("Радиус круга: ", ee)

# import math # 32 задача
# f = int(input("Введите радиус основания: "))
# ff = int(input("Введите высоту цилиндра: "))
# fff = ((f**2) * math.pi) * ff
# print("Площадь цилиндра: ", round(fff, 3))

# g = int(input("Введите первое число: ")) # 33 задача
# gg = int(input("введите второе число: "))
# g1 = g // gg
# g2 = g % gg
# print("При делении", g, "на", gg, "получается", g1, "с остатком", g2)

# import math # 34 задача
# h = int(input("1)Квадрат\n2)Треугольник\n\nВведите числом нужную операцию: "))
# if h == 1:
#     hh = int(input("Введите длину стороны квадрата: "))
#     hhh = hh**2
#     print("Площадь квадрата: ", hhh)
# elif h == 2:
#     hh = int(input("Введите длину стороны треугольника: "))
#     hhh = int(input("Введите длину высоты треугольника проведенной к этой стороне: "))
#     hhhh = (1/2) * hh * hhh
#     print("Площадь треугольника: ", hhhh)
# else:
#     print("Ошибка")
