# text1 = input("Введите ваше имя: ")# первая и вторая задача
# print ("Привет -", text1)
# text2 = input("Введите вашу фамилию: ")
# print ("Привет - ", text1, text2)
#
# print ("«What do you call a bear with no teeth?»\n«A gummy bear!»") # третья задача
#
# a = int(input("Введите первое число: "))# четвертая задача
# b = int(input("Введите второе число: "))
# c = a + b
# print("Результат - ", c)
#
# d = int(input("Введите третье число: "))# пятая задача
# e = c * d
# print("Результат - ", e)
#
# ab = int(input("Сколько кусков пищи у вас было? "))# шестая задача
# ac = int(input("Сколько кусков пиццы вы съели? "))
# ad = ab - ac
# print("У вас осталось", ad, "кусков пиццы.")
#
# name = input("Введате ваше имя: ") # седьмая задача
# age = int(input("Ведите ваш возраст "))
# age2 = age + 1
# print(name, ", через год вам будет", age2, "лет")
#
# chek = int(input("Введите сумму счета: ")) # восьмая задача
# pipl = int(input("Ведите количество участников: "))
# shet = chek / pipl
# print("Каждый должен заплатить по: ", shet, "рублей")
#
# dni = int(input("Ведите количество дней: ")) # девятая задача
# chas = dni * 24
# mint = chas * 60
# cek = mint * 60
# print("В введенных днях -", chas, "часов,", mint, "минут,", cek,"секунд")
#
# kg = int(input("Ввелите количество килограмм: ")) # десятая задача
# ph = kg * 2.024
# print("В", kg,"кг -", ph,"фунтов")
#
# ch1 = int(input("Ведите число больше 100: ")) # одинадцатая задача
# ch2 = int(input("Введите число меньше 10: "))
# rez = ch1 // ch2
# print("Число ",ch2,"поместиться в ",ch1,"- ",rez," раз")